app/views/sessions/edit.html.erb

    <label>Select Interviewee</label>
    <%= select("session", "user_id", User.all.collect {|u| [ u.username, u.id ] }, { include_blank: true }) %>
---
SELECT "users".* FROM "users"