app/views/sessions/new.html.erb

SELECT "users".* FROM "users"
---
    <label>Select Interviewee</label><br>
    <%= select("session", "user_id", User.all.collect {|u| [ u.username, u.id ] }, { include_blank: true }) %>