app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "dhruv"], ["email", "d@e.com"], ["created_at", "2020-05-21 07:33:35.763674"], ["updated_at", "2020-05-21 07:33:35.763674"]]
---
    def create
        @user = User.new(user_params)
        @user.save